samimasad/STE-LPC1768-/UART_TEST/src/LedBlinky.c
/******************************************************************************/
/* BLINKY.C: LED Flasher                                                      */
/******************************************************************************/
/* This file is part of the uVision/ARM development tools.                    */
/* Copyright (c) 2008 Keil Software. All rights reserved.                     */
/* This software may only be used under the terms of a valid, current,        */
/* end user licence from KEIL for a compatible version of KEIL software       */
/* development tools. Nothing else gives you the right to use this software.  */
/******************************************************************************/

#include "lpc17xx_gpio.h"
#include "lpc17xx_libcfg.h"
#include "lpc17xx_nvic.h"

#define LED_NUM     8                   /* Number of user LEDs                */

const unsigned long led_mask[] = { 1<<28, 1<<29, 1UL<<31, 1<<2, 1<<3, 1<<4, 1<<5, 1<<6 };
volatile unsigned long SysTickCnt;      /* SysTick Counter                    */

void SysTick_Handler (void) {           /* SysTick Interrupt Handler (1ms)    */
  SysTickCnt++;
}

void Delay (unsigned long tick) {       /* Delay Function                     */
  unsigned long systickcnt;

  systickcnt = SysTickCnt;
  while ((SysTickCnt - systickcnt) < tick);
}

int c_entry (void) {                       /* Main Program                       */
  int num = -1;
  int dir =  1;

	//  Set Vector table offset value
#if (__RAM_MODE__==1)
	NVIC_SetVTOR(0x10000000);
#else
	NVIC_SetVTOR(0x00000000);
#endif


  SysTick_Config(SystemCoreClock/1000 - 1); /* Generate interrupt each 1 ms   */


  GPIO_SetDir(1, 0xB0000000, 1);           /* LEDs on PORT1 defined as Output    */
  GPIO_SetDir(2, 0x0000007C, 1);           /* LEDs on PORT2 defined as Output    */

  GPIO_ClearValue(1, 0xB0000000);
  GPIO_ClearValue(2, 0x0000007C);

  for (;;) {                            /* Loop forever                       */
    /* Calculate 'num': 0,1,...,LED_NUM-1,LED_NUM-1,...,1,0,0,...             */
    num += dir;
    if (num == LED_NUM) { dir = -1; num =  LED_NUM-1; }
    else if   (num < 0) { dir =  1; num =  0;         }

    if (num < 3){
        GPIO_SetValue(1, led_mask[num]);
        Delay(500);                         /* Delay 500ms                        */
        GPIO_ClearValue(1, led_mask[num]);
        Delay(500);                         /* Delay 500ms                        */
    }
    else {
        GPIO_SetValue(2, led_mask[num]);
        Delay(500);                         /* Delay 500ms                        */
        GPIO_ClearValue(2, led_mask[num]);
        Delay(500);                         /* Delay 500ms                        */
    }
  }
}


/* With ARM and GHS toolsets, the entry point is main() - this will
   allow the linker to generate wrapper code to setup stacks, allocate
   heap area, and initialize and copy code and data segments. For GNU
   toolsets, the entry point is through __start() in the crt0_gnu.asm
   file, and that startup code will setup stacks and data */
int main(void)
{
    return c_entry();
}

#ifdef  DEBUG
/*******************************************************************************
* @brief		Reports the name of the source file and the source line number
* 				where the CHECK_PARAM error has occurred.
* @param[in]	file Pointer to the source file name
* @param[in]    line assert_param error line source number
* @return		None
*******************************************************************************/

#endif
